Revit 2024 API
RevitLinkInstance.MoveBasePointToHostBasePoint Method
 Moves this link instance so that the base point in the linked document is aligned to the base point in the host document. This is a one-time movement and does not set up any shared coordinates relationship.
 If the rotation angle of this link instance was changed after insertion, the rotation angle can be preserved or reset to the original insertion angle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016 SubscriptionUpdate
Syntax
C#
public void MoveBasePointToHostBasePoint(
	bool resetToOriginalRotation
)
Visual Basic
Public Sub MoveBasePointToHostBasePoint ( _
	resetToOriginalRotation As Boolean _
)
Visual C++
public:
void MoveBasePointToHostBasePoint(
	bool resetToOriginalRotation
)
Parameters
resetToOriginalRotation
Type: System.Boolean
 Sets to true if:
 restoring the original insertion angle of the link instance after it is moved if there was a rotation \ mirror transform on the link instance.
 there was no a rotation \ mirror transform on the link instance.
 Sets to false to retain the current angle of the link instance after it is moved if there was a rotation \ mirror transform on the link instance.
Remarks
 The link must be loaded for Revit to find the location of the link's base point. This operation can only be performed on instances of top-level links.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This RevitLinkInstance is not an instance of a loaded RevitLinkType. -or- This RevitLinkInstance is not an instance of a top-level RevitLinkType. -or- The operation is not permitted because the element is pinned.
See Also
RevitLinkInstance Class
Autodesk.Revit.DB Namespace